JMeter Tests/Test 3 - Spike Test/spike_report/statistics.json
{
  "GET - All Farms (/api/farms)" : {
    "transaction" : "GET - All Farms (/api/farms)",
    "sampleCount" : 560,
    "errorCount" : 151,
    "errorPct" : 26.964285,
    "meanResTime" : 4646.353571428568,
    "medianResTime" : 1487.0,
    "minResTime" : 252.0,
    "maxResTime" : 43531.0,
    "pct1ResTime" : 10103.200000000008,
    "pct2ResTime" : 27999.799999999945,
    "pct3ResTime" : 41336.77,
    "throughput" : 2.8286542677321265,
    "receivedKBytesPerSec" : 6.811100944757898,
    "sentKBytesPerSec" : 1.5862444374008708
  },
  "POST - Spike Surge Login" : {
    "transaction" : "POST - Spike Surge Login",
    "sampleCount" : 115,
    "errorCount" : 41,
    "errorPct" : 35.652172,
    "meanResTime" : 23601.895652173913,
    "medianResTime" : 23931.0,
    "minResTime" : 1984.0,
    "maxResTime" : 44956.0,
    "pct1ResTime" : 40662.0,
    "pct2ResTime" : 42411.19999999999,
    "pct3ResTime" : 44872.16,
    "throughput" : 2.1226328029827606,
    "receivedKBytesPerSec" : 4.121613593155894,
    "sentKBytesPerSec" : 0.421498348037949
  },
  "POST - Baseline Login" : {
    "transaction" : "POST - Baseline Login",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1493.8,
    "medianResTime" : 1523.0,
    "minResTime" : 1027.0,
    "maxResTime" : 2208.0,
    "pct1ResTime" : 2208.0,
    "pct2ResTime" : 2208.0,
    "pct3ResTime" : 2208.0,
    "throughput" : 1.0078613182826044,
    "receivedKBytesPerSec" : 1.3060859075791171,
    "sentKBytesPerSec" : 0.3110197036887724
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1445,
    "errorCount" : 415,
    "errorPct" : 28.719723,
    "meanResTime" : 5609.6892733563955,
    "medianResTime" : 1959.0,
    "minResTime" : 252.0,
    "maxResTime" : 44956.0,
    "pct1ResTime" : 19381.400000000016,
    "pct2ResTime" : 31571.1,
    "pct3ResTime" : 41846.92,
    "throughput" : 7.192847969575996,
    "receivedKBytesPerSec" : 15.787282410126734,
    "sentKBytesPerSec" : 3.9855634376835543
  },
  "GET - Harvest History (/api/farms/harvests)" : {
    "transaction" : "GET - Harvest History (/api/farms/harvests)",
    "sampleCount" : 513,
    "errorCount" : 123,
    "errorPct" : 23.976608,
    "meanResTime" : 3782.04873294347,
    "medianResTime" : 1408.0,
    "minResTime" : 311.0,
    "maxResTime" : 43313.0,
    "pct1ResTime" : 5366.600000000002,
    "pct2ResTime" : 21261.499999999985,
    "pct3ResTime" : 40082.08000000001,
    "throughput" : 2.612774583254814,
    "receivedKBytesPerSec" : 7.270917476049567,
    "sentKBytesPerSec" : 1.5359958401878346
  },
  "POST - Submit Inquiry (/api/inquiries)" : {
    "transaction" : "POST - Submit Inquiry (/api/inquiries)",
    "sampleCount" : 252,
    "errorCount" : 100,
    "errorPct" : 39.68254,
    "meanResTime" : 3341.9246031746015,
    "medianResTime" : 2297.5,
    "minResTime" : 253.0,
    "maxResTime" : 41821.0,
    "pct1ResTime" : 4630.600000000003,
    "pct2ResTime" : 16464.449999999997,
    "pct3ResTime" : 27216.369999999995,
    "throughput" : 4.191616766467066,
    "receivedKBytesPerSec" : 2.757408360362608,
    "sentKBytesPerSec" : 2.672649492681304
  }
}